In [48]:
import pandas as pd

# excel dosyasından okuma

In [49]:
excel_data=pd.read_excel("6.13 excelle çalışmak.xlsx")

In [50]:
excel_data

  Unnamed: 0  maas   yas  departman
0      buğra   100  40.0    yazılım
1      yusuf   150  20.0      satış
2      eymen   200  31.0        NaN
3      oktay   250  72.0  pazarlama
4      güzel   300   NaN      finas
5        ali   350  16.0      hukuk

BURADA BEN BOŞ DEĞERLERİ DOLDURMAYA ÇALIŞTIM

In [51]:
excel_data["yas"]=excel_data["yas"].fillna(excel_data["yas"].mean())

In [52]:
excel_data

  Unnamed: 0  maas   yas  departman
0      buğra   100  40.0    yazılım
1      yusuf   150  20.0      satış
2      eymen   200  31.0        NaN
3      oktay   250  72.0  pazarlama
4      güzel   300  35.8      finas
5        ali   350  16.0      hukuk

In [53]:
excel_data2=pd.read_excel("6.13 excelle çalışmak.xlsx")
excel_data2

  Unnamed: 0  maas   yas  departman
0      buğra   100  40.0    yazılım
1      yusuf   150  20.0      satış
2      eymen   200  31.0        NaN
3      oktay   250  72.0  pazarlama
4      güzel   300   NaN      finas
5        ali   350  16.0      hukuk

BURADA NaN OLAN SATIRLARI ATIYORUZ

In [54]:
excel_data2_full=excel_data2.dropna()
excel_data2_full

  Unnamed: 0  maas   yas  departman
0      buğra   100  40.0    yazılım
1      yusuf   150  20.0      satış
3      oktay   250  72.0  pazarlama
5        ali   350  16.0      hukuk

In [55]:
excel_data2_full

  Unnamed: 0  maas   yas  departman
0      buğra   100  40.0    yazılım
1      yusuf   150  20.0      satış
3      oktay   250  72.0  pazarlama
5        ali   350  16.0      hukuk

In [65]:
excel_data2_full.columns=['isim', 'maas', 'yas', 'departman']

sütun isim değiştirme

In [66]:
excel_data2_full

    isim  maas   yas  departman
0  buğra   100  40.0    yazılım
1  yusuf   150  20.0      satış
3  oktay   250  72.0  pazarlama
5    ali   350  16.0      hukuk

BURADA DA DERLEYİCİDEN EXCEL'E GEÇİŞ YAPIYORUZ DOSYA OLUSTURUYORUZ

In [58]:
excel_data2_full.to_excel("3.13 excelle çalışmak full.xlsx")